<div>
  당첨된 분들의 개인정보 보호를 위해 성함 및 연락처 뒷자리 일부분을 별표로 표기하여 공지합니다. <br />
  <br />
  - 경품은 이벤트 참여자 대상으로 별도 추첨이 진행되며, <br /> 당첨자 발표 후 영업일 기준 7일 내 개별 연락을 통해 안내 예정입니다. <br />
  - 당첨자는 경품 발송을 위한 안내에 응답하지 않을 경우 당첨이 자동 취소됩니다. <br />
  <br /> <br />

  배민상품권 (3명)
  <br /> <br />
  신*경 (251*) <br />
  신*경 (251*) <br />
  신*경 (251*) <br />
  <br />
  <br />
  스마트스토어 10% 할인쿠폰 (10명) <br />
  <br />
  신*경 (251*) <br />
  신*경 (251*) <br />
  신*경 (251*) <br />
  신*경 (251*) <br />
  신*경 (251*) <br />
  신*경 (251*) <br />
  신*경 (251*) <br />
  신*경 (251*) <br />
  신*경 (251*) <br />
  신*경 (251*) <br />
  <br /> <br />
</div>