<div class="header homeheader">
  <div class="header-logo-div" onclick="gopage('quiz')">숏Quiz</div>
  <div class="header-menu">
    <div class="header-egg" onclick="gopage('mypage')"><svg width="14" height="17" viewBox="0 0 14 17" fill="none" xmlns="http://www.w3.org/2000/svg">
        <path d="M7.00016 16.7504C5.21266 16.7504 3.69634 16.1278 2.4512 14.8827C1.20607 13.6376 0.583496 12.1212 0.583496 10.3337C0.583496 9.15735 0.778288 7.97333 1.16787 6.78166C1.55745 5.58999 2.06162 4.50909 2.68037 3.53895C3.29912 2.56881 3.99044 1.77819 4.75433 1.16708C5.51822 0.555967 6.26683 0.25 7.00016 0.25C7.74877 0.25 8.5012 0.555967 9.25745 1.16708C10.0137 1.77819 10.7012 2.56881 11.32 3.53895C11.9387 4.50909 12.4429 5.58999 12.8325 6.78166C13.222 7.97333 13.4168 9.15735 13.4168 10.3337C13.4168 12.1212 12.7943 13.6376 11.5491 14.8827C10.304 16.1278 8.78766 16.7504 7.00016 16.7504Z" fill="#FFA439" />
      </svg>
      <span class="span white-span">0</span>
    </div>
    <div class="header-cal" onclick="gopage('list')"><svg width="32" height="32" viewBox="0 0 32 32" fill="none" xmlns="http://www.w3.org/2000/svg">
        <mask id="mask0_10024_22876" style="mask-type:alpha" maskUnits="userSpaceOnUse" x="0" y="0" width="32" height="32">
          <rect width="32" height="32" fill="#D9D9D9" />
        </mask>
        <g mask="url(#mask0_10024_22876)">
          <path d="M21.1812 13.5977L15.8913 17.1052C15.6996 17.2394 15.5031 17.2537 15.3019 17.1483C15.1006 17.0429 15 16.8752 15 16.6452V9.5727C15 9.3427 15.1006 9.17499 15.3019 9.06957C15.5031 8.96416 15.6996 8.97853 15.8913 9.1127L21.1812 12.6202C21.3537 12.7352 21.44 12.8981 21.44 13.1089C21.44 13.3198 21.3537 13.4827 21.1812 13.5977Z" fill="#333333" />
          <path d="M12 23.9998C11.2667 23.9998 10.6389 23.7387 10.1167 23.2165C9.59444 22.6943 9.33333 22.0665 9.33333 21.3332V5.33317C9.33333 4.59984 9.59444 3.97206 10.1167 3.44984C10.6389 2.92762 11.2667 2.6665 12 2.6665H24C24.7333 2.6665 25.3611 2.92762 25.8833 3.44984C26.4056 3.97206 26.6667 4.59984 26.6667 5.33317V21.3332C26.6667 22.0665 26.4056 22.6943 25.8833 23.2165C25.3611 23.7387 24.7333 23.9998 24 23.9998H12ZM12 21.3332H24V5.33317H12V21.3332ZM6.66667 29.3332C5.93333 29.3332 5.30556 29.0721 4.78333 28.5498C4.26111 28.0276 4 27.3998 4 26.6665V9.33317C4 8.95539 4.12778 8.63873 4.38333 8.38317C4.63889 8.12762 4.95556 7.99984 5.33333 7.99984C5.71111 7.99984 6.02778 8.12762 6.28333 8.38317C6.53889 8.63873 6.66667 8.95539 6.66667 9.33317V26.6665H20C20.3778 26.6665 20.6944 26.7943 20.95 27.0498C21.2056 27.3054 21.3333 27.6221 21.3333 27.9998C21.3333 28.3776 21.2056 28.6943 20.95 28.9498C20.6944 29.2054 20.3778 29.3332 20 29.3332H6.66667Z" fill="#333333" />
        </g>
      </svg>

    </div>
    <div class="header-home"><svg width="32" height="33" viewBox="0 0 32 33" fill="none" xmlns="http://www.w3.org/2000/svg">
        <mask id="mask0_9923_2959" style="mask-type:alpha" maskUnits="userSpaceOnUse" x="0" y="0" width="32" height="33">
          <rect y="0.5" width="32" height="32" fill="#D9D9D9" />
        </mask>
        <g mask="url(#mask0_9923_2959)">
          <path d="M6.91625 26.1009H11.2906V18.8103C11.2906 18.3972 11.4304 18.0509 11.7098 17.7714C11.9893 17.4919 12.3356 17.3522 12.7487 17.3522H18.5813C18.9944 17.3522 19.3407 17.4919 19.6202 17.7714C19.8996 18.0509 20.0394 18.3972 20.0394 18.8103V26.1009H24.4137V12.9778L15.665 6.41625L6.91625 12.9778V26.1009ZM4 26.1009V12.9778C4 12.5161 4.10328 12.0786 4.30985 11.6655C4.51642 11.2524 4.80197 10.9121 5.1665 10.6448L13.9152 4.08325C14.4256 3.69442 15.0088 3.5 15.665 3.5C16.3212 3.5 16.9044 3.69442 17.4148 4.08325L26.1635 10.6448C26.528 10.9121 26.8136 11.2524 27.0201 11.6655C27.2267 12.0786 27.33 12.5161 27.33 12.9778V26.1009C27.33 26.9029 27.0445 27.5894 26.4734 28.1605C25.9023 28.7316 25.2157 29.0172 24.4137 29.0172H18.5813C18.1681 29.0172 17.8218 28.8775 17.5423 28.598C17.2629 28.3185 17.1231 27.9722 17.1231 27.5591V20.2684H14.2069V27.5591C14.2069 27.9722 14.0671 28.3185 13.7877 28.598C13.5082 28.8775 13.1619 29.0172 12.7487 29.0172H6.91625C6.11428 29.0172 5.42775 28.7316 4.85665 28.1605C4.28555 27.5894 4 26.9029 4 26.1009Z" fill="#333333" />
        </g>
      </svg>
    </div>
  </div>

</div>


<script>
  $(document).ready(function() {
    clearInterval(timerInterval);
    console.log("흰헤더");
    eggUpdate();
  });

  // 알 상태 자동 업데이트
  function eggUpdate() {
    let currentEggCount = localStorage.getItem('eggCount');
    if (currentEggCount === null) {
      currentEggCount = 0;
    } else {
      // 문자열로 저장되어 있으므로 숫자로 변환
      currentEggCount = parseInt(currentEggCount, 10);
    }

    // 증가된 숫자를 화면에 반영
    document.querySelector('.header-egg .white-span').innerText = currentEggCount;

    // 증가된 숫자를 localStorage에 저장
    localStorage.setItem('eggCount', currentEggCount);
    console.log("흰헤더의 알")
    console.log(currentEggCount)
  }

  function gopage(link) {
    if (link == 'quiz') {
      window.location.href = "/sr/";
    } else if (link == 'form') {
      window.location.href = "/sr/sign";
    } else if (link == 'mypage') {
      window.location.href = "/sr/mypage";
    } else if (link == 'list') {
      window.location.href = "/sr/list";
    } else if (link == 'result') {
      window.location.href = "/sr/result";
    } else if (link == 'home') {
      window.location.href = "https://www.banggooso.com/";
    };
  }
</script>